function bmi()
{
    let w = parseInt(document.getElementById('weight').value)
    let h = parseInt(document.getElementById('height').value)
    let bmi = w/((h/100)*(h/100))
    bmi = bmi.toFixed(1)
    console.log(bmi) 
    displayBMI(bmi)
}
function displayBMI(bmi)
{
    let result
    if(bmi < 18.5){
        result ="เกณฑ์น้ำหนักน้อยกว่ามาตรฐาน"
        color = "blue"
        detail = "คุณควรรับประทานอาหารประเภท ไขมัน เเป้ง เนื้อสัตว์ มากขึ้นเนื่องจากน้ำหนักน้อยเกินไป ควรเติมสารอาหารให้กับร่างกายบ้าง ขณะเดียวกันคุณก็ต้องเพิ่มกล้ามเนื้อด้วย เพื่อให้ร่างกายเผาผลาญไขมันได้ดีขึ้น (กล้ามเนื้อหนักกว่าไขมัน) โดยออกกำลังกายเบาๆ ไม่หนักมากเช่น เดินเร็ว ปั่นจักรยาน"
    }else if(18.5 <=bmi && bmi<=22.9){
        result ="เกณฑ์น้ำหนักปกติ"
        color = "green"
        detail = "ร่างกายคุณปกติอยู่เเล้ว เเสดงถึงลักษณะการรับประทานอาหารที่เพียงพอต่อร่างกาย ไม่ขาดไม่เกินจนเกินไป อาหารที่รับประทานยังคงเป็น 5 หมู่เหมือนเดิม เเละควรทานเมล็ดธัญพืชเช่น ถั่ว เเอลมอนต์ ให้ร่างกายได้รับไขมันดี <p>ส่วนออกกำลังกายอย่างน้อย 3 วัน/สัปดาห์ ได้ทั้งกีฬาสบายๆ อย่าง เดิน หรือกีฬาที่ใช้พลังงานเยอะอย่าง วิ่ง ว่ายน้ำ"
    }else if(23 <=bmi && bmi<=24.9){
        result ="เกณฑ์รูปร่างท้วม / อ้วนระดับ 1"
        color = "yellow"
        detail = "ถึงเเม้คุณจะอยู่ในเกณฑ์อ้วน เเต่หากคุณตระหนักถึงความสำคัญเรื่องสุขภาพก็ไม่ต้องกังวลไป เพราะคุณสามารถกลับมามีสุขภาพดี เพียงควบคุมเเคลอรี่อาหารต่อหนึ่งวัน ให้อยู่ในระหว่าง 1,600 – 2,000 เเคลอรี่<p>ออกกำลังกายมากกว่า 3 วัน/สัปดาห์ เเละมีวินัยพอที่จะทำอย่างสม่ำเสมอ เพียงเท่านี้ร่างกายคุณก็พร้อมที่จะกลับมาสู่เกณฑ์ปกติอย่างเช่นเดิมได้เเล้ว"
    }else if(25 <=bmi && bmi<=29.9){
        result ="เกณฑ์รูปร่างอ้วน / อ้วนระดับ 2"
        color = "orange"
        detail = "ถึงเเม้คุณจะอยู่ในเกณฑ์อ้วน เเต่หากคุณตระหนักถึงความสำคัญเรื่องสุขภาพก็ไม่ต้องกังวลไป เพราะคุณสามารถกลับมามีสุขภาพดี เพียงควบคุมเเคลอรี่อาหารต่อหนึ่งวัน ให้อยู่ในระหว่าง 1,600 – 2,000 เเคลอรี่<p>ออกกำลังกายมากกว่า 3 วัน/สัปดาห์ เเละมีวินัยพอที่จะทำอย่างสม่ำเสมอ เพียงเท่านี้ร่างกายคุณก็พร้อมที่จะกลับมาสู่เกณฑ์ปกติอย่างเช่นเดิมได้เเล้ว"
    }else{
        result ="เกณฑ์รูปร่างอ้วนมาก / อ้วนระดับ 3"
        color = "red"
        detail = " เมื่อเกณฑ์รูปร่างคุณอยู่ขั้นนี้เเสดงถึงลักษณะการกินที่ไม่ถูกกิจลักษณะหรือบริโภคต่อวันมากเกินไป สิ่งที่ควรละเว้นเลยคือของทอด ขนมปัง บ่อเกิดเเห่งไขมันชั้นดี เลือกทานอาหารปรุงน้อยหรือไม่ใส่น้ำมันเลย ส่วนเนื้อสัตว์ควรทาน เนื้อปลา อกไก่ ที่ไม่มีไขมันเข้ามาเเทรก<p>เเละที่สำคัญคือการออกกำลังกาย เมื่อถึงขั้นนี้เเล้วการออกกำลังกายอาจไม่ใช่กิจกรรมที่คุณทำบ่อยมากนัก เเต่เน้นกีฬาที่ชอบเเละสม่ำเสมอ จะช่วยให้เกณฑ์รูปร่างขึ้นดีขึ้นจนกลับสู่เกณฑ์ปกติ"
    }
    console.log(result)
    document.getElementById("result").innerHTML="<h2 style='background-color:"+color+";'>"+result+"</h2><br/>"
    document.getElementById("result").innerHTML+="<p>"+detail+"</p>"
}